 
const tasks = {
  "tasks": {
      "2102": {
          id: "2102",
          "unique_number": {
              "value": "2405056"
          },
          "name": {
              "value": "SR01800583  - включение технической УЗ в группу доступа к АС DocStore"
          },
          "division_name": {
              "value": "Дистанционная ипотека"
          },
          "description": {
              "value": ""
          },
          "task_doer_user_text": {
              "value": "Смелый Р."
          },
          "task_create_user": {
              "value": "Портнов В."
          },
          "status": {
              "value": "В работе"
          },
          "date_expected": {
              "value": "06.30.2020"
          },
          "effective_expected": {
              "value": 0.0
          },
          "star": {
              "value": 3
          },
          "show": {
            "value": true
          },
          "color": {
            "value": 'red'
          }
      },
      "2094": {
          id: "2094",
          "unique_number": {
              "value": "2405048"
          },
          "name": {
              "value": "Автоматизация в очереди СРОТ \"ЖКУ:МОД\""
          },
          "division_name": {
              "value": "Реализация и эксплуатация имущества"
          },
          "description": {
              "value": "Автоматизация в очереди СРОТ \"ЖКУ:МОД\""
          },
          "task_doer_user_text": {
              "value": "Иванов С. С., Иванова М. Ю."
          },
          "task_create_user": {
              "value": "Иванов С."
          },
          "status": {
              "value": "Создано"
          },
          "date_expected": {
              "value": "07.01.2020"
          },
          "effective_expected": {
              "value": 1.5
          },
          "star": {
              "value": 2
          },
          "show": {
            "value": false
          },
          "color": {
            "value": 'red'
          }
      },
      "2093": {
          id: "2093",
          "unique_number": {
              "value": "2405047"
          },
          "name": {
              "value": "автоматизация по модерации проектов на строим"
          },
          "division_name": {
              "value": "Контакт центр"
          },
          "description": {
              "value": "😳 1.\tНа изображении Логотип компании и водяной знак должно быть не более 10% от общ.площади изображения. \r\n2.\tКачество картинки цветное и не размытое\r\n3.\tИзображение не содержит флаги, гербы, ордена, символы и пр. не относящиеся к проекту. \r\n4.\tИзображение дома занимает не менее ¾ или 70% от всего рендера. \r\n5.\tНа изображении: животные, люди, машины, занимает не более ¼ от общ. площади рендера. \r\n6.\tОбъемно-планировочные решения, указанные в карточке проекта, соответствуют приложенным планам и схемам. \r\n7.\tТехнико-экономические показатели, указанные в карточке проекта, соответствуют приложенным планам и схемам.\r\n8.\tНаличие или отсутствие изображения и его соответствие разделу (рендер к рендерам, фото построенного объекта, план по этажам и пр.).  \r\n"
          },
          "task_doer_user_text": {
              "value": ""
          },
          "task_create_user": {
              "value": "Великий B."
          },
          "status": {
              "value": "Создано"
          },
          "date_expected": {
              "value": "08.15.2020"
          },
          "effective_expected": {
              "value": 0.0
          },
          "star": {
              "value": 0
          },
          "show": {
            "value": false
          },
          "color": {
            "value": 'blue'
          }
      },
      "2092": {
          id: "2092",
          "unique_number": {
              "value": "2405046"
          },
          "name": {
              "value": "Автоматизация проверки подрядчиков на различных сайтах по списку "
          },
          "division_name": {
              "value": "Контакт центр"
          },
          "description": {
              "value": "2.\thttps://spark-interfax.ru/  - запрос по ИНН, ответ – дата гос. регистрации и наличие судебных дел за посл. 12 мес. И о наличии исп. производств. \r\n3.\thttps://bankrot.fedresurs.ru/ - запрос по ИНН, ответ – наличие или отсутствие информации о банкротстве (да/нет). \r\n4.\t https://zakupki.gov.ru/epz/main/public/home.html - запрос по ИНН, ответ - наличие или отсутствие информации в реестре недобросовестных поставщиков. \r\n5.\thttps://fedresurs.ru/?attempt=1 – запрос по ИНН, ответ – сведения об исключении организации из ЕГРЮЛ. \r\n6.\thttps://pb.nalog.ru/ - для юр.лиц запрос по ИНН, ответ – сведение о невозможности участия в организации. для ИП запрос по ИНН и ФИО, ответ – сведение о невозможности участия в организации (наличие или отсутствие). \r\n7.\thttps://service.nalog.ru/bi.do - запрос по ИНН и БИК/маска из 9ти цифр, ответ – информации о приостановке операций по счетам. \r\n8.\thttps://www.gosuslugi.ru/pay - запрос по ИНН, ответ – информация об оплате платежей (гос.пошлины, сборы и пр.). \r\n9.\thttps://kad.arbitr.ru/ для юр.лиц запрос по ИНН и краткое наименование, ответ – информация о делах (банкротство/судебные иски). Для ИП запрос по ИНН и ФИО (кратное и полное), ответ – информация о делах (банкротство/судебные иски).\r\n"
          },
          "task_doer_user_text": {
              "value": ""
          },
          "task_create_user": {
              "value": "Великий В."
          },
          "status": {
              "value": "Создано"
          },
          "date_expected": {
              "value": "10.15.2020"
          },
          "effective_expected": {
              "value": 2.3
          },
          "star": {
              "value": 2
          },
          "show": {
            "value": true
          },
          "color": {
            "value": 'gray'
          }
      },
      "2091": {
          id: "2091",
          "unique_number": {
              "value": "2405045"
          },
          "name": {
              "value": "автоматизация отчетов по модерации на строим."
          },
          "division_name": {
              "value": "Контакт центр"
          },
          "description": {
              "value": "Оптимизация сводов в отчетах в эксель.\r\nМетрики: \r\n•\tкол.уникальных подрядчиков\r\n•\tСтатус по последней заявке\r\n•\tПо последней заявке комментарий (причина отказа)\r\n•\tКоличество заявок всего и статус по ним\r\n"
          },
          "task_doer_user_text": {
              "value": ""
          },
          "task_create_user": {
              "value": "Великий В."
          },
          "status": {
              "value": "Создано"
          },
          "date_expected": {
              "value": "10.15.2020"
          },
          "effective_expected": {
              "value": 1.2
          },
          "star": {
              "value": 3
          },
          "show": {
            "value": false
          },
          "color": {
            "value": 'green'
          }
      },
      "2095": {
          id: "2095",
          "unique_number": {
              "value": "2405048"
          },
          "name": {
              "value": "автоматизация отчетов "
          },
          "division_name": {
              "value": "Отдел кадров"
          },
          "description": {
              "value": "сделать формы отчета для демонстрации"
          },
          "task_doer_user_text": {
              "value": ""
          },
          "task_create_user": {
              "value": "Иванова В."
          },
          "status": {
              "value": "Создано"
          },
          "date_expected": {
              "value": "10.15.2020"
          },
          "effective_expected": {
              "value": 1.5
          },
          "star": {
              "value": 3
          },
          "show": {
            "value": false
          },
          "color": {
            "value": 'green'
          }
      }
  },
  "metaInfo": {
      "counterTasks": 5,
      "unique_number": {
          "description": "Уникальный id задачи",
          "required": true,
          "unique": true,
          "model": true
      },
      "name": {
          "description": "Название задачи",
          "required": true,
          "unique": false,
          "model": true
      },
      "division_name": {
          "description": "Название подразделения",
          "required": false,
          "unique": false,
          "model": false
      },
      "description": {
          "description": "Описание задачи",
          "required": true,
          "unique": false,
          "model": true
      },
      "task_doer_user_text": {
          "description": "Текстовое поле. Исполнитель",
          "required": false,
          "unique": false,
          "model": true
      },
      "task_create_user": {
          "description": "Записавший задачу в реестр",
          "required": false,
          "unique": false,
          "model": true
      },
      "status": {
          "descriptions": "Текущий статус задачи",
          "required": true,
          "unique": false,
          "model": true
      },
      "date_expected": {
          "descriptions": "Дата ожидаемой реализации",
          "required": true,
          "unique": false,
          "model": true
      },
      "effective_expected": {
          "descriptions": "Ожидаемый эффект ПШЕ",
          "required": true,
          "unique": false,
          "model": true
      }
  }
}


const initialData = {
    tasks: tasks.tasks,
    columns: {
      'column-1': {
        id: 'column-1',
        title: 'Бэклог',
        taskIds: ['2094', '2092', '2093'],
      },
      'column-2': {
        id: 'column-2',
        title: 'В работе',
        taskIds: ['2091'],
      },
      'column-3': {
        id: 'column-3',
        title: 'Готово',
        taskIds: ['2095', '2102'],
      },
      'column-4': {
        id: 'column-4',
        title: 'Архив',
        taskIds: [],
      },
      'column-5': {
        id: 'column-5',
        title: 'Выполнено',
        taskIds: [],
      },
    },
    // Facilitate reordering of the columns
    columnOrder: ['column-1', 'column-2', 'column-3', 'column-4'],
  };
  
export default initialData;


const InitialTaskList = {
    '2094':[
        {id:'2094-1', value:'1. под задача //', done:false}
    ],
    '2092':[
        {id:'2092-1', value:'1. решить вопрос', done:false}
    ],
    '2093':[
        {id:'2093-1', value:'1. сформировать тз\n- придумать концепт\n\t - назначить дату', done:true},
        {id:'2093-2', value:'2. отладить код', done:true},
        {id:'2093-3', value:'3. провести тест', done:true}
    ],
    '2102':[
        {id:'2102-1', value:'1. доступы необходимо оформлять по другой заявке', done:true},
        {id:'2102-2', value:'2. УЗ включили в группу', done:true},
    ],
    '2091':[
        {id:'2091-1', value:'1 определить ', done:true},
        {id:'2091-2', value:'2 начать тест', done:false},
        {id:'2091-3', value:'3 выпустить в прод', done:false}
    ],
}

export {InitialTaskList};